rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Simpsons"], ["created_at", "2018-10-17 22:42:33.782995"], ["updated_at", "2018-10-17 22:42:33.782995"]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "The LEGO Movie"], ["updated_at", "2018-10-17 22:48:16.893059"], ["id", 1]]

  def similar
    @id = params[:id]

    # Get director information for the current movie
    @selected_movie = Movie.find(params[:id])
    @director = @selected_movie.director
    if @director.nil? || @director.empty?
      flash[:notice] = "'#{@selected_movie.title}' has no director info"
      redirect_to movies_path
    end

    # Find movies that match the director (if info exists)
    @movies = Movie.where(director: @director).order({:title => :asc})
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ?  ORDER BY "movies"."title" ASC LIMIT 1  [["director", ""]]